xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxEvadc_bf.h
/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDGR */
#define IFX_EVADC_GLOB_TF_CDGR_OFF (4u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDEN */
#define IFX_EVADC_GLOB_TF_CDEN_OFF (8u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDSEL */
#define IFX_EVADC_GLOB_TF_CDSEL_OFF (9u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.CDWC */
#define IFX_EVADC_GLOB_TF_CDWC_OFF (15u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.PDD */
#define IFX_EVADC_GLOB_TF_PDD_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.MDPD */
#define IFX_EVADC_GLOB_TF_MDPD_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.MDPD */
#define IFX_EVADC_GLOB_TF_MDPD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.MDPD */
#define IFX_EVADC_GLOB_TF_MDPD_OFF (17u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.MDPU */
#define IFX_EVADC_GLOB_TF_MDPU_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.MDPU */
#define IFX_EVADC_GLOB_TF_MDPU_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.MDPU */
#define IFX_EVADC_GLOB_TF_MDPU_OFF (18u)

/** \brief Length for Ifx_EVADC_GLOB_TF_Bits.MDWC */
#define IFX_EVADC_GLOB_TF_MDWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_TF_Bits.MDWC */
#define IFX_EVADC_GLOB_TF_MDWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_TF_Bits.MDWC */
#define IFX_EVADC_GLOB_TF_MDWC_OFF (23u)

/** \brief Length for Ifx_EVADC_GLOB_TE_Bits.TFEP */
#define IFX_EVADC_GLOB_TE_TFEP_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_TE_Bits.TFEP */
#define IFX_EVADC_GLOB_TE_TFEP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_TE_Bits.TFEP */
#define IFX_EVADC_GLOB_TE_TFEP_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_TE_Bits.TFES */
#define IFX_EVADC_GLOB_TE_TFES_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_TE_Bits.TFES */
#define IFX_EVADC_GLOB_TE_TFES_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_TE_Bits.TFES */
#define IFX_EVADC_GLOB_TE_TFES_OFF (8u)

/** \brief Length for Ifx_EVADC_GLOB_RCR_Bits.DRCTR */
#define IFX_EVADC_GLOB_RCR_DRCTR_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_RCR_Bits.DRCTR */
#define IFX_EVADC_GLOB_RCR_DRCTR_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_RCR_Bits.DRCTR */
#define IFX_EVADC_GLOB_RCR_DRCTR_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_RCR_Bits.WFR */
#define IFX_EVADC_GLOB_RCR_WFR_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_RCR_Bits.WFR */
#define IFX_EVADC_GLOB_RCR_WFR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_RCR_Bits.WFR */
#define IFX_EVADC_GLOB_RCR_WFR_OFF (24u)

/** \brief Length for Ifx_EVADC_GLOB_RCR_Bits.SRGEN */
#define IFX_EVADC_GLOB_RCR_SRGEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_RCR_Bits.SRGEN */
#define IFX_EVADC_GLOB_RCR_SRGEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_RCR_Bits.SRGEN */
#define IFX_EVADC_GLOB_RCR_SRGEN_OFF (31u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.RESULT */
#define IFX_EVADC_GLOB_RES_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.RESULT */
#define IFX_EVADC_GLOB_RES_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.RESULT */
#define IFX_EVADC_GLOB_RES_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.GNR */
#define IFX_EVADC_GLOB_RES_GNR_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.GNR */
#define IFX_EVADC_GLOB_RES_GNR_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.GNR */
#define IFX_EVADC_GLOB_RES_GNR_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.CHNR */
#define IFX_EVADC_GLOB_RES_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.CHNR */
#define IFX_EVADC_GLOB_RES_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.CHNR */
#define IFX_EVADC_GLOB_RES_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_OFF (25u)

